z = '*' * 80


def jump(jump):
    if jump == 10:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Начинающий путешественник'
        ach_3 = ' (совершить 10 прыжков)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif jump == 100:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Набирающий опыт'
        ach_3 = ' (совершить 100 прыжков)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif jump == 250:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Умелый'
        ach_3 = ' (совершить 250 прыжков)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif jump == 500:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Бывалый'
        ach_3 = ' (совершить 500 прыжков)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif jump == 750:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Опытный'
        ach_3 = ' (совершить 750 прыжков)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif jump == 1000:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Неутомимый'
        ach_3 = ' (совершить 1000 прыжков)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)


def e_sys(e_sys):
    if e_sys == 10:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Начинающий исследователь'
        ach_3 = ' (совершить 10 исследований систем)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif e_sys == 100:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Любопытный'
        ach_3 = ' (совершить 100 исследований систем)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif e_sys == 250:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Ищущий знаний'
        ach_3 = ' (совершить 250 исследований систем)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif e_sys == 500:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Первооткрыватель'
        ach_3 = ' (совершить 500 исследований систем)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif e_sys == 750:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Ученый'
        ach_3 = ' (совершить 750 исследований систем)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif e_sys == 1000:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Профессиональный исследователь'
        ach_3 = ' (совершить 1000 исследований систем)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)


def e_st(e_st):
    if e_st == 10:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Внимательный звездочет'
        ach_3 = ' (совершить 10 исследований звезд по отдельности)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif e_st == 100:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Отдельно, отдельно и еще раз отдельно'
        ach_3 = ' (совершить 100 исследований звезд по отдельности)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif e_st == 250:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Звезды от плевел'
        ach_3 = ' (совершить 250 исследований звезд по отдельности)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif e_st == 500:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Перепись звезд'
        ach_3 = ' (совершить 500 исследований звезд по отдельности)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif e_st == 750:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Звезда за звездой'
        ach_3 = ' (совершить 750 исследований звезд по отдельности)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif e_st == 1000:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Каждая звезда требует внимания'
        ach_3 = ' (совершить 1000 исследований звезд по отдельности)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)


def e_sts(e_sts):
    if e_sts == 10:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Между двух огней'
        ach_3 = ' (совершить 10 совместных исследований звезд)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif e_sts == 100:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Собираем статистику'
        ach_3 = ' (совершить 100 совместных исследований звезд)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif e_sts == 250:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Их много, а я один'
        ach_3 = ' (совершить 250 совместных исследований звезд)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif e_sts == 500:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Звездоход'
        ach_3 = ' (совершить 500 совместных исследований звезд)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif e_sts == 750:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Круговорот звезд в природе'
        ach_3 = ' (совершить 750 совместных исследований звезд)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif e_sts == 1000:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Звездная пыль на крыле'
        ach_3 = ' (совершить 1000 совместных исследований звезд)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)


def e_bh(e_bh):
    if e_bh == 10:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Не подбирайся слишком близко'
        ach_3 = ' (совершить 10 исследований черных дыр по отдельности)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif e_bh == 100:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Сингулярность внутри, время снаружи'
        ach_3 = ' (совершить 100 исследований черных дыр по отдельности)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif e_bh == 250:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Темным темно'
        ach_3 = ' (совершить 250 исследований черных дыр по отдельности)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif e_bh == 500:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Темнее черного'
        ach_3 = ' (совершить 500 исследований черных дыр по отдельности)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif e_bh == 750:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Черный, темнее и еще темнее'
        ach_3 = ' (совершить 750 исследований черных дыр по отдельности)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif e_bh == 1000:
        ach_1 = 'Вы получили достижение: '
        ach_2 = '50 оттенков черного'
        ach_3 = ' (совершить 1000 исследований черных дыр по отдельности)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)


def e_bhs(e_bhs):
    if e_bhs == 10:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Наследие большого взрыва'
        ach_3 = ' (совершить 10 совместных исследований черных дыр)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif e_bhs == 100:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Сингулярность в квадрате'
        ach_3 = ' (совершить 100 совместных исследований черных дыр)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif e_bhs == 250:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Темные светила'
        ach_3 = ' (совершить 250 совместных исследований черных дыр)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif e_bhs == 500:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Теория "Ничего"'
        ach_3 = ' (совершить 500 совместных исследований черных дыр)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif e_bhs == 750:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Бесконечности в струнах'
        ach_3 = ' (совершить 750 совместных исследований черных дыр)'
        print(ach_1+'\n'+ach_2+ach_3+'\n'+z)
    elif e_bhs == 1000:
        ach_1 = 'Вы получили достижение: '
        ach_2 = 'Конец и начало'
        ach_3 = ' (совершить 1000 совместных исследований черных дыр)'
